Microchip-MPLAB-Harmony/csp/apps/rtc/rtc_alarm/firmware/src/packs/ATSAMV71Q21B_DFP/component/pmc.h
/* -------- PMC_SLPWK_AIPR : (PMC Offset: 0x144) (R/  32) SleepWalking Activity In Progress Register -------- */
#define PMC_SLPWK_AIPR_AIP_Pos                (0U)                                           /**< (PMC_SLPWK_AIPR) Activity In Progress Position */
#define PMC_SLPWK_AIPR_AIP_Msk                (0x1U << PMC_SLPWK_AIPR_AIP_Pos)               /**< (PMC_SLPWK_AIPR) Activity In Progress Mask */
#define PMC_SLPWK_AIPR_AIP(value)             (PMC_SLPWK_AIPR_AIP_Msk & ((value) << PMC_SLPWK_AIPR_AIP_Pos))
#define PMC_SLPWK_AIPR_Msk                    (0x00000001UL)                                 /**< (PMC_SLPWK_AIPR) Register Mask  */

/** \brief PMC register offsets definitions */
#define PMC_SCER_OFFSET                (0x00)         /**< (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_OFFSET                (0x04)         /**< (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_OFFSET                (0x08)         /**< (PMC_SCSR) System Clock Status Register Offset */
#define PMC_PCER0_OFFSET               (0x10)         /**< (PMC_PCER0) Peripheral Clock Enable Register 0 Offset */
#define PMC_PCDR0_OFFSET               (0x14)         /**< (PMC_PCDR0) Peripheral Clock Disable Register 0 Offset */
#define PMC_PCSR0_OFFSET               (0x18)         /**< (PMC_PCSR0) Peripheral Clock Status Register 0 Offset */
#define CKGR_UCKR_OFFSET               (0x1C)         /**< (CKGR_UCKR) UTMI Clock Register Offset */
#define CKGR_MOR_OFFSET                (0x20)         /**< (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_OFFSET               (0x24)         /**< (CKGR_MCFR) Main Clock Frequency Register Offset */
#define CKGR_PLLAR_OFFSET              (0x28)         /**< (CKGR_PLLAR) PLLA Register Offset */
#define PMC_MCKR_OFFSET                (0x30)         /**< (PMC_MCKR) Master Clock Register Offset */
#define PMC_USB_OFFSET                 (0x38)         /**< (PMC_USB) USB Clock Register Offset */
#define PMC_PCK_OFFSET                 (0x40)         /**< (PMC_PCK) Programmable Clock Register Offset */
#define PMC_IER_OFFSET                 (0x60)         /**< (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_OFFSET                 (0x64)         /**< (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_OFFSET                  (0x68)         /**< (PMC_SR) Status Register Offset */
#define PMC_IMR_OFFSET                 (0x6C)         /**< (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FSMR_OFFSET                (0x70)         /**< (PMC_FSMR) Fast Startup Mode Register Offset */
#define PMC_FSPR_OFFSET                (0x74)         /**< (PMC_FSPR) Fast Startup Polarity Register Offset */
#define PMC_FOCR_OFFSET                (0x78)         /**< (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_WPMR_OFFSET                (0xE4)         /**< (PMC_WPMR) Write Protection Mode Register Offset */
#define PMC_WPSR_OFFSET                (0xE8)         /**< (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCER1_OFFSET               (0x100)        /**< (PMC_PCER1) Peripheral Clock Enable Register 1 Offset */
#define PMC_PCDR1_OFFSET               (0x104)        /**< (PMC_PCDR1) Peripheral Clock Disable Register 1 Offset */
#define PMC_PCSR1_OFFSET               (0x108)        /**< (PMC_PCSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_PCR_OFFSET                 (0x10C)        /**< (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR_OFFSET                 (0x110)        /**< (PMC_OCR) Oscillator Calibration Register Offset */
#define PMC_SLPWK_ER0_OFFSET           (0x114)        /**< (PMC_SLPWK_ER0) SleepWalking Enable Register 0 Offset */
#define PMC_SLPWK_DR0_OFFSET           (0x118)        /**< (PMC_SLPWK_DR0) SleepWalking Disable Register 0 Offset */
#define PMC_SLPWK_SR0_OFFSET           (0x11C)        /**< (PMC_SLPWK_SR0) SleepWalking Status Register 0 Offset */
#define PMC_SLPWK_ASR0_OFFSET          (0x120)        /**< (PMC_SLPWK_ASR0) SleepWalking Activity Status Register 0 Offset */
#define PMC_PMMR_OFFSET                (0x130)        /**< (PMC_PMMR) PLL Maximum Multiplier Value Register Offset */
#define PMC_SLPWK_ER1_OFFSET           (0x134)        /**< (PMC_SLPWK_ER1) SleepWalking Enable Register 1 Offset */
#define PMC_SLPWK_DR1_OFFSET           (0x138)        /**< (PMC_SLPWK_DR1) SleepWalking Disable Register 1 Offset */
#define PMC_SLPWK_SR1_OFFSET           (0x13C)        /**< (PMC_SLPWK_SR1) SleepWalking Status Register 1 Offset */
#define PMC_SLPWK_ASR1_OFFSET          (0x140)        /**< (PMC_SLPWK_ASR1) SleepWalking Activity Status Register 1 Offset */
#define PMC_SLPWK_AIPR_OFFSET          (0x144)        /**< (PMC_SLPWK_AIPR) SleepWalking Activity In Progress Register Offset */

/** \brief PMC register API structure */
typedef struct
{
  __O   uint32_t                       PMC_SCER;        /**< Offset: 0x00 ( /W  32) System Clock Enable Register */
  __O   uint32_t                       PMC_SCDR;        /**< Offset: 0x04 ( /W  32) System Clock Disable Register */
  __I   uint32_t                       PMC_SCSR;        /**< Offset: 0x08 (R/   32) System Clock Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PMC_PCER0;       /**< Offset: 0x10 ( /W  32) Peripheral Clock Enable Register 0 */
  __O   uint32_t                       PMC_PCDR0;       /**< Offset: 0x14 ( /W  32) Peripheral Clock Disable Register 0 */
  __I   uint32_t                       PMC_PCSR0;       /**< Offset: 0x18 (R/   32) Peripheral Clock Status Register 0 */
  __IO  uint32_t                       CKGR_UCKR;       /**< Offset: 0x1c (R/W  32) UTMI Clock Register */
  __IO  uint32_t                       CKGR_MOR;        /**< Offset: 0x20 (R/W  32) Main Oscillator Register */
  __IO  uint32_t                       CKGR_MCFR;       /**< Offset: 0x24 (R/W  32) Main Clock Frequency Register */
  __IO  uint32_t                       CKGR_PLLAR;      /**< Offset: 0x28 (R/W  32) PLLA Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       PMC_MCKR;        /**< Offset: 0x30 (R/W  32) Master Clock Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       PMC_USB;         /**< Offset: 0x38 (R/W  32) USB Clock Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       PMC_PCK[8];      /**< Offset: 0x40 (R/W  32) Programmable Clock Register */
  __O   uint32_t                       PMC_IER;         /**< Offset: 0x60 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       PMC_IDR;         /**< Offset: 0x64 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       PMC_SR;          /**< Offset: 0x68 (R/   32) Status Register */
  __I   uint32_t                       PMC_IMR;         /**< Offset: 0x6c (R/   32) Interrupt Mask Register */
  __IO  uint32_t                       PMC_FSMR;        /**< Offset: 0x70 (R/W  32) Fast Startup Mode Register */
  __IO  uint32_t                       PMC_FSPR;        /**< Offset: 0x74 (R/W  32) Fast Startup Polarity Register */
  __O   uint32_t                       PMC_FOCR;        /**< Offset: 0x78 ( /W  32) Fault Output Clear Register */
  __I   uint8_t                        Reserved5[0x68];
  __IO  uint32_t                       PMC_WPMR;        /**< Offset: 0xe4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       PMC_WPSR;        /**< Offset: 0xe8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved6[0x14];
  __O   uint32_t                       PMC_PCER1;       /**< Offset: 0x100 ( /W  32) Peripheral Clock Enable Register 1 */
  __O   uint32_t                       PMC_PCDR1;       /**< Offset: 0x104 ( /W  32) Peripheral Clock Disable Register 1 */
  __I   uint32_t                       PMC_PCSR1;       /**< Offset: 0x108 (R/   32) Peripheral Clock Status Register 1 */
  __IO  uint32_t                       PMC_PCR;         /**< Offset: 0x10c (R/W  32) Peripheral Control Register */
  __IO  uint32_t                       PMC_OCR;         /**< Offset: 0x110 (R/W  32) Oscillator Calibration Register */
  __O   uint32_t                       PMC_SLPWK_ER0;   /**< Offset: 0x114 ( /W  32) SleepWalking Enable Register 0 */
  __O   uint32_t                       PMC_SLPWK_DR0;   /**< Offset: 0x118 ( /W  32) SleepWalking Disable Register 0 */
  __I   uint32_t                       PMC_SLPWK_SR0;   /**< Offset: 0x11c (R/   32) SleepWalking Status Register 0 */
  __I   uint32_t                       PMC_SLPWK_ASR0;  /**< Offset: 0x120 (R/   32) SleepWalking Activity Status Register 0 */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       PMC_PMMR;        /**< Offset: 0x130 (R/W  32) PLL Maximum Multiplier Value Register */
  __O   uint32_t                       PMC_SLPWK_ER1;   /**< Offset: 0x134 ( /W  32) SleepWalking Enable Register 1 */
  __O   uint32_t                       PMC_SLPWK_DR1;   /**< Offset: 0x138 ( /W  32) SleepWalking Disable Register 1 */
  __I   uint32_t                       PMC_SLPWK_SR1;   /**< Offset: 0x13c (R/   32) SleepWalking Status Register 1 */
  __I   uint32_t                       PMC_SLPWK_ASR1;  /**< Offset: 0x140 (R/   32) SleepWalking Activity Status Register 1 */
  __I   uint32_t                       PMC_SLPWK_AIPR;  /**< Offset: 0x144 (R/   32) SleepWalking Activity In Progress Register */
} pmc_registers_t;
/** @}  end of Power Management Controller */

#endif /* SAMV_SAMV71_PMC_MODULE_H */

